import asyncio
import aiohttp
import re
import datetime
import requests
import os
import threading

# ===================== 配置 =====================
urls = [
        "http://1.192.12.1:9901",
        "http://1.192.248.1:9901",
        "http://1.194.52.1:10086",
        "http://1.195.111.1:11190",
        "http://1.195.131.1:9901",
        "http://1.195.62.1:9901",
        "http://1.196.192.1:9901",
        "http://1.196.55.1:9901",
        "http://1.197.153.1:9901",
        "http://1.197.203.1:9901",
        "http://1.198.30.1:9901",
        "http://1.198.67.1:9901",
        "http://1.199.234.1:9901",
        "http://1.199.235.1:9901",
        "http://101.65.32.1:9901",
        "http://101.66.199.1:9901",
        "http://101.74.28.1:9901",
        "http://103.39.222.1:9999",
        "http://106.115.121.1:9901",
        "http://106.46.147.1:10443",
        "http://106.46.34.1:9901",
        "http://106.55.164.1:9901",
        "http://110.189.180.1:9901",
        "http://110.52.99.1:9901",
        "http://111.225.114.1:808",
        "http://111.225.115.1:9901",
        "http://111.33.89.1:9901",
        "http://111.59.63.1:9901",
        "http://111.74.155.1:9901",
        "http://111.78.22.1:9901",
        "http://111.78.34.1:9901",
        "http://111.8.224.1:8085",
        "http://111.8.242.1:8085",
        "http://112.123.218.1:9901",
        "http://112.123.219.1:9901",
        "http://112.132.160.1:9901",
        "http://112.193.114.1:9901",
        "http://112.193.42.1:9901",
        "http://112.194.128.1:9901",
        "http://112.194.140.1:9901",
        "http://112.194.206.1:9901",
        "http://112.5.89.1:9900",
        "http://112.5.89.1:9901",
        "http://112.6.117.1:9901",
        "http://112.99.200.1:9901",
        "http://113.100.72.1:9901",
        "http://113.111.104.1:9901",
        "http://113.116.145.1:8883",
        "http://113.116.56.1:8883",
        "http://113.195.4.1:9901",
        "http://113.195.45.1:9901",
        "http://113.195.7.1:9901",
        "http://113.195.8.1:9901",
        "http://113.220.232.1:9999",
        "http://113.220.233.1:9999",
        "http://113.220.234.1:9999",
        "http://113.220.235.1:9999",
        "http://113.223.12.1:9998",
        "http://113.236.30.1:9901",
        "http://113.245.217.1:9901",
        "http://113.245.218.1:9901",
        "http://115.207.24.1:9901",
        "http://115.215.143.1:9901",
        "http://115.220.17.1:9901",
        "http://115.224.206.1:9901",
        "http://115.225.233.1:9901",
        "http://115.236.171.1:9901",
        "http://115.236.83.1:1111",
        "http://115.48.160.1:9901",
        "http://115.48.161.1:9901",
        "http://115.48.22.1:9901",
        "http://116.117.107.1:8096",
        "http://116.128.224.1:9901",
        "http://116.128.242.1:9901",
        "http://116.167.111.1:9901",
        "http://116.167.76.1:9901",
        "http://116.167.79.1:9901",
        "http://116.227.232.1:7777",
        "http://116.233.34.1:7777",
        "http://116.30.121.1:8883",
        "http://116.31.165.1:280",
        "http://116.31.165.1:3079",
        "http://118.248.167.1:8088",
        "http://118.248.168.1:8088",
        "http://118.248.169.1:8088",
        "http://118.248.170.1:8088",
        "http://118.248.216.1:8088",
        "http://118.253.0.1:2023",
        "http://118.72.69.1:888",
        "http://118.81.106.1:9999",
        "http://118.81.107.1:9999",
        "http://119.119.77.1:9901",
        "http://119.120.196.1:9999",
        "http://119.142.76.1:9901",
        "http://119.142.77.1:9901",
        "http://119.163.199.1:9901",
        "http://119.163.228.1:9901",
        "http://119.163.56.1:9901",
        "http://119.163.57.1:9901",
        "http://119.163.60.1:9901",
        "http://119.163.61.1:9901",
        "http://119.163.63.1:9901",
        "http://119.164.81.1:9901",
        "http://119.62.28.1:9901",
        "http://119.62.36.1:9901",
        "http://119.62.80.1:9901",
        "http://120.0.52.1:8086",
        "http://120.0.8.1:8086",
        "http://120.197.43.1:9901",
        "http://120.198.96.1:9901",
        "http://120.198.99.1:9901",
        "http://120.211.129.1:9901",
        "http://120.224.178.1:9901",
        "http://120.224.23.1:9901",
        "http://120.238.150.1:9901",
        "http://120.238.85.1:9901",
        "http://121.19.134.1:808",
        "http://121.232.178.1:5000",
        "http://121.232.187.1:6000",
        "http://121.238.176.1:9901",
        "http://121.24.98.1:9901",
        "http://121.33.239.1:9901",
        "http://122.4.92.1:9991",
        "http://123.10.69.1:9901",
        "http://123.10.70.1:9901",
        "http://123.10.71.1:9901",
        "http://123.101.144.1:9901",
        "http://123.101.98.1:9898",
        "http://123.12.148.1:9901",
        "http://123.129.70.1:9901",
        "http://123.13.28.1:9901",
        "http://123.13.29.1:9901",
        "http://123.13.57.1:9901",
        "http://123.13.60.1:9901",
        "http://123.13.80.1:9901",
        "http://123.13.83.1:9901",
        "http://123.130.84.1:8154",
        "http://123.131.200.1:9901",
        "http://123.132.234.1:8154",
        "http://123.138.216.1:9902",
        "http://123.138.22.1:9901",
        "http://123.139.57.1:9901",
        "http://123.149.160.1:9901",
        "http://123.149.163.1:9901",
        "http://123.154.154.1:9901",
        "http://123.154.155.1:9901",
        "http://123.154.157.1:9901",
        "http://123.163.94.1:9901",
        "http://123.182.209.1:8088",
        "http://123.182.211.1:8088",
        "http://123.182.212.1:9901",
        "http://123.182.247.1:4433",
        "http://123.183.24.1:6666",
        "http://123.183.25.1:6666",
        "http://123.183.27.1:6666",
        "http://123.189.36.1:9901",
        "http://123.235.8.1:9901",
        "http://123.4.125.1:9901",
        "http://123.52.12.1:9901",
        "http://123.54.171.1:9901",
        "http://123.54.220.1:9901",
        "http://123.55.3.1:9901",
        "http://123.7.110.1:9901",
        "http://123.9.47.1:9901",
        "http://124.238.110.1:9999",
        "http://124.66.82.1:9901",
        "http://124.90.211.1:9901",
        "http://124.94.193.1:9902",
        "http://125.106.86.1:9901",
        "http://125.107.177.1:9901",
        "http://125.107.97.1:9901",
        "http://125.114.210.1:9901",
        "http://125.114.241.1:9901",
        "http://125.115.210.1:9901",
        "http://125.119.48.1:9901",
        "http://125.125.129.1:9901",
        "http://125.125.133.1:9901",
        "http://125.125.134.1:9901",
        "http://125.125.225.1:9901",
        "http://125.125.233.1:9901",
        "http://125.125.234.1:9901",
        "http://125.125.236.1:9901",
        "http://125.32.120.1:9901",
        "http://125.42.148.1:9901",
        "http://125.42.150.1:9901",
        "http://125.42.151.1:9901",
        "http://125.43.240.1:9901",
        "http://125.43.244.1:9901",
        "http://125.43.247.1:9901",
        "http://125.43.249.1:9901",
        "http://14.212.185.1:9901",
        "http://14.216.204.1:8883",
        "http://14.216.215.1:8883",
        "http://14.216.218.1:8883",
        "http://14.216.220.1:8883",
        "http://14.216.221.1:8883",
        "http://14.216.227.1:8883",
        "http://14.29.76.1:9901",
        "http://144.52.160.1:9901",
        "http://144.52.162.1:9901",
        "http://150.255.145.1:9901",
        "http://150.255.149.1:9901",
        "http://150.255.150.1:9901",
        "http://150.255.157.1:9901",
        "http://150.255.216.1:9901",
        "http://153.0.204.1:9901",
        "http://163.177.122.1:9901",
        "http://171.104.198.1:8181",
        "http://171.106.217.1:8181",
        "http://171.108.239.1:8181",
        "http://171.109.208.1:8099",
        "http://171.109.6.1:8181",
        "http://171.12.164.1:9901",
        "http://171.12.189.1:9901",
        "http://171.14.89.1:9901",
        "http://171.35.124.1:10011",
        "http://171.38.194.1:8082",
        "http://171.8.75.1:8011",
        "http://180.113.102.1:5000",
        "http://180.117.149.1:9901",
        "http://180.124.146.1:60000",
        "http://180.175.163.1:7777",
        "http://180.213.174.1:9901",
        "http://182.112.188.1:9901",
        "http://182.112.28.1:9901",
        "http://182.113.201.1:9901",
        "http://182.113.206.1:9901",
        "http://182.113.6.1:9901",
        "http://182.114.185.1:9901",
        "http://182.114.212.1:9901",
        "http://182.114.214.1:9901",
        "http://182.114.215.1:9901",
        "http://182.114.48.1:9901",
        "http://182.114.49.1:9901",
        "http://182.114.50.1:9901",
        "http://182.117.136.1:9901",
        "http://182.117.90.1:9901",
        "http://182.120.229.1:9901",
        "http://182.122.122.1:9901",
        "http://182.122.73.1:10086",
        "http://182.125.172.1:9901",
        "http://182.126.114.1:9901",
        "http://183.10.180.1:9901",
        "http://183.10.181.1:9901",
        "http://183.131.246.1:9901",
        "http://183.136.148.1:9901",
        "http://183.203.147.1:9901",
        "http://183.203.151.1:9901",
        "http://183.238.113.1:8883",
        "http://183.239.226.1:9901",
        "http://183.24.48.1:9901",
        "http://183.255.41.1:9901",
        "http://183.63.15.1:9901",
        "http://183.94.146.1:2222",
        "http://202.100.46.1:9901",
        "http://202.168.187.1:2024",
        "http://202.168.187.1:9999",
        "http://210.22.75.1:9901",
        "http://211.142.224.1:2023",
        "http://218.13.170.1:9901",
        "http://218.29.147.1:9901",
        "http://218.71.245.1:9901",
        "http://218.74.169.1:9901",
        "http://218.74.171.1:9901",
        "http://218.75.241.1:9901",
        "http://218.76.32.1:9901",
        "http://218.77.81.1:9901",
        "http://218.87.237.1:9901",
        "http://220.161.206.1:9901",
        "http://220.163.178.1:8888",
        "http://220.164.192.1:50085",
        "http://220.179.68.1:9901",
        "http://220.180.109.1:9901",
        "http://220.180.109.1:9902",
        "http://220.180.112.1:9901",
        "http://220.180.229.1:9901",
        "http://220.202.98.1:14901",
        "http://220.248.173.1:9901",
        "http://221.205.131.1:9999",
        "http://221.206.104.1:9901",
        "http://221.213.69.1:9901",
        "http://221.213.94.1:9901",
        "http://221.224.4.1:1111",
        "http://221.224.72.1:9901",
        "http://221.225.236.1:9901",
        "http://221.226.4.1:9901",
        "http://221.226.8.1:9527",
        "http://221.233.192.1:1111",
        "http://221.7.239.1:8181",
        "http://221.9.97.1:9901",
        "http://222.134.245.1:9901",
        "http://222.136.68.1:9901",
        "http://222.138.109.1:9901",
        "http://222.140.9.1:9901",
        "http://222.142.198.1:9901",
        "http://222.142.72.1:9901",
        "http://222.142.73.1:9901",
        "http://222.142.93.1:9901",
        "http://222.169.70.1:9901",
        "http://222.92.7.1:3334",
        "http://223.151.51.1:9901",
        "http://223.159.11.1:8099",
        "http://223.159.8.1:8099",
        "http://223.159.9.1:8099",
        "http://223.166.234.1:7777",
        "http://223.199.83.1:9901",
        "http://223.241.247.1:9901",
        "http://223.243.10.1:9008",
        "http://223.243.2.1:9008",
        "http://223.68.201.1:9901",
        "http://36.249.150.1:9901",
        "http://36.249.151.1:9901",
        "http://36.34.58.1:9901",
        "http://36.35.220.1:9901",
        "http://36.35.223.1:9901",
        "http://36.40.236.1:9999",
        "http://36.44.157.1:9901",
        "http://36.44.159.1:9901",
        "http://36.49.56.1:9901",
        "http://36.99.134.1:9901",
        "http://36.99.206.1:9901",
        "http://39.152.171.1:9901",
        "http://39.164.202.1:8899",
        "http://39.164.222.1:888",
        "http://39.165.44.1:9901",
        "http://39.74.142.1:9999",
        "http://42.225.203.1:9901",
        "http://42.225.222.1:9901",
        "http://42.235.4.1:9901",
        "http://42.237.248.1:9901",
        "http://42.237.26.1:9901",
        "http://58.20.77.1:9002",
        "http://58.209.101.1:9901",
        "http://58.210.23.1:9901",
        "http://58.210.60.1:9901",
        "http://58.216.229.1:9901",
        "http://58.218.184.1:9901",
        "http://58.220.219.1:1099",
        "http://58.220.219.1:9901",
        "http://58.23.26.1:9901",
        "http://58.23.27.1:9901",
        "http://58.242.103.1:9901",
        "http://58.243.224.1:9901",
        "http://58.243.234.1:9901",
        "http://58.243.33.1:9901",
        "http://58.243.93.1:9901",
        "http://58.245.97.1:9901",
        "http://58.245.99.1:9901",
        "http://58.48.37.1:1111",
        "http://58.48.5.1:1111",
        "http://58.51.111.1:1111",
        "http://58.51.111.1:9901",
        "http://58.53.152.1:9901",
        "http://58.53.153.1:9901",
        "http://58.53.154.1:9901",
        "http://58.53.155.1:9901",
        "http://58.57.155.1:9901",
        "http://58.57.21.1:9901",
        "http://58.57.40.1:9901",
        "http://59.173.183.1:9901",
        "http://59.173.243.1:9901",
        "http://60.187.74.1:9901",
        "http://60.190.18.1:9901",
        "http://60.209.232.1:9901",
        "http://60.213.92.1:9901",
        "http://60.217.73.1:83",
        "http://60.255.137.1:9901",
        "http://60.255.47.1:8801",
        "http://60.255.47.1:9901",
        "http://60.4.9.1:9901",
        "http://61.130.72.1:8888",
        "http://61.136.172.1:9901",
        "http://61.136.67.1:50085",
        "http://61.138.128.1:19901",
    ]

CHANNEL_CATEGORIES = {
    "央视频道": [
        "CCTV1", "CCTV2", "CCTV3", "CCTV4", "CCTV4欧洲", "CCTV4美洲", "CCTV5", "CCTV5+", "CCTV6", "CCTV7",
        "CCTV8", "CCTV9", "CCTV10", "CCTV11", "CCTV12", "CCTV13", "CCTV14", "CCTV15", "CCTV16", "CCTV17", "CCTV4K", "CCTV8K",
        "兵器科技", "风云音乐", "风云足球", "风云剧场", "怀旧剧场", "第一剧场", "女性时尚", "世界地理", "央视台球", "高尔夫网球",
        "央视文化精品", "卫生健康", "电视指南", "中学生", "发现之旅", "书法频道", "国学频道", "环球奇观"
    ],
    "卫视频道": [
        "湖南卫视", "浙江卫视", "江苏卫视", "东方卫视", "深圳卫视", "北京卫视", "广东卫视", "广西卫视", "东南卫视", "海南卫视",
        "河北卫视", "河南卫视", "湖北卫视", "江西卫视", "四川卫视", "重庆卫视", "贵州卫视", "云南卫视", "天津卫视", "安徽卫视",
        "山东卫视", "辽宁卫视", "黑龙江卫视", "吉林卫视", "内蒙古卫视", "宁夏卫视", "山西卫视", "陕西卫视", "甘肃卫视", "青海卫视",
        "新疆卫视", "西藏卫视", "三沙卫视", "兵团卫视", "延边卫视", "安多卫视", "康巴卫视", "农林卫视", "山东教育卫视",
        "中国教育1台", "中国教育2台", "中国教育3台", "中国教育4台", "早期教育"
    ],
    "数字频道": [
        "CHC动作电影", "CHC家庭影院", "CHC影迷电影", "淘电影", "淘精彩", "淘剧场", "淘4K", "淘娱乐", "淘BABY", "淘萌宠", "重温经典",
        "星空卫视", "CHANNEL[V]", "凤凰卫视中文台", "凤凰卫视资讯台", "凤凰卫视香港台", "凤凰卫视电影台", "求索纪录", "求索科学",
        "求索生活", "求索动物", "纪实人文", "金鹰纪实", "纪实科教", "睛彩青少", "睛彩竞技", "睛彩篮球", "睛彩广场舞", "魅力足球", "五星体育",
        "劲爆体育", "快乐垂钓", "茶频道", "先锋乒羽", "天元围棋", "汽摩", "梨园频道", "文物宝库", "武术世界", "哒啵赛事", "哒啵电竞", "黑莓电影", "黑莓动画", 
        "乐游", "生活时尚", "都市剧场", "欢笑剧场", "游戏风云", "金色学堂", "动漫秀场", "新动漫", "卡酷少儿", "金鹰卡通", "优漫卡通", "哈哈炫动", "嘉佳卡通", 
        "中国交通", "中国天气"
    ],
}

CHANNEL_MAPPING = {
    "CCTV1": ["CCTV-1", "CCTV-1 HD", "CCTV1 HD", "CCTV-1综合"],
    "CCTV2": ["CCTV-2", "CCTV-2 HD", "CCTV2 HD", "CCTV-2财经"],
    "CCTV3": ["CCTV-3", "CCTV-3 HD", "CCTV3 HD", "CCTV-3综艺"],
    "CCTV4": ["CCTV-4", "CCTV-4 HD", "CCTV4 HD", "CCTV-4中文国际"],
    "CCTV4欧洲": ["CCTV-4欧洲", "CCTV-4欧洲", "CCTV4欧洲 HD", "CCTV-4 欧洲", "CCTV-4中文国际欧洲", "CCTV4中文欧洲"],
    "CCTV4美洲": ["CCTV-4美洲", "CCTV-4北美", "CCTV4美洲 HD", "CCTV-4 美洲", "CCTV-4中文国际美洲", "CCTV4中文美洲"],
    "CCTV5": ["CCTV-5", "CCTV-5 HD", "CCTV5 HD", "CCTV-5体育"],
    "CCTV5+": ["CCTV-5+", "CCTV-5+ HD", "CCTV5+ HD", "CCTV-5+体育赛事"],
    "CCTV6": ["CCTV-6", "CCTV-6 HD", "CCTV6 HD", "CCTV-6电影"],
    "CCTV7": ["CCTV-7", "CCTV-7 HD", "CCTV7 HD", "CCTV-7国防军事"],
    "CCTV8": ["CCTV-8", "CCTV-8 HD", "CCTV8 HD", "CCTV-8电视剧"],
    "CCTV9": ["CCTV-9", "CCTV-9 HD", "CCTV9 HD", "CCTV-9纪录"],
    "CCTV10": ["CCTV-10", "CCTV-10 HD", "CCTV10 HD", "CCTV-10科教"],
    "CCTV11": ["CCTV-11", "CCTV-11 HD", "CCTV11 HD", "CCTV-11戏曲"],
    "CCTV12": ["CCTV-12", "CCTV-12 HD", "CCTV12 HD", "CCTV-12社会与法"],
    "CCTV13": ["CCTV-13", "CCTV-13 HD", "CCTV13 HD", "CCTV-13新闻"],
    "CCTV14": ["CCTV-14", "CCTV-14 HD", "CCTV14 HD", "CCTV-14少儿"],
    "CCTV15": ["CCTV-15", "CCTV-15 HD", "CCTV15 HD", "CCTV-15音乐"],
    "CCTV16": ["CCTV-16", "CCTV-16 HD", "CCTV-16 4K", "CCTV-16奥林匹克", "CCTV16 4K", "CCTV-16奥林匹克4K"],
    "CCTV17": ["CCTV-17", "CCTV-17 HD", "CCTV17 HD", "CCTV-17农业农村"],
    "CCTV4K": ["CCTV4K超高清", "CCTV-4K超高清", "CCTV-4K 超高清", "CCTV 4K"],
    "CCTV8K": ["CCTV8K超高清", "CCTV-8K超高清", "CCTV-8K 超高清", "CCTV 8K"],
    "兵器科技": ["CCTV-兵器科技", "CCTV兵器科技"],
    "风云音乐": ["CCTV-风云音乐", "CCTV风云音乐"],
    "第一剧场": ["CCTV-第一剧场", "CCTV第一剧场"],
    "风云足球": ["CCTV-风云足球", "CCTV风云足球"],
    "风云剧场": ["CCTV-风云剧场", "CCTV风云剧场"],
    "怀旧剧场": ["CCTV-怀旧剧场", "CCTV怀旧剧场"],
    "女性时尚": ["CCTV-女性时尚", "CCTV女性时尚"],
    "世界地理": ["CCTV-世界地理", "CCTV世界地理"],
    "央视台球": ["CCTV-央视台球", "CCTV央视台球"],
    "高尔夫网球": ["CCTV-高尔夫网球", "CCTV高尔夫网球", "CCTV央视高网", "CCTV-高尔夫·网球", "央视高网"],
    "央视文化精品": ["CCTV-央视文化精品", "CCTV央视文化精品", "CCTV文化精品", "CCTV-文化精品", "文化精品"],
    "卫生健康": ["CCTV-卫生健康", "CCTV卫生健康"],
    "电视指南": ["CCTV-电视指南", "CCTV电视指南"],
    "农林卫视": ["陕西农林卫视"],
    "三沙卫视": ["海南三沙卫视"],
    "兵团卫视": ["新疆兵团卫视"],
    "延边卫视": ["吉林延边卫视"],
    "安多卫视": ["青海安多卫视"],
    "康巴卫视": ["四川康巴卫视"],
    "山东教育卫视": ["山东教育"],
    "中国教育1台": ["CETV1", "中国教育一台", "中国教育1", "CETV-1 综合教育", "CETV-1"],
    "中国教育2台": ["CETV2", "中国教育二台", "中国教育2", "CETV-2 空中课堂", "CETV-2"],
    "中国教育3台": ["CETV3", "中国教育三台", "中国教育3", "CETV-3 教育服务", "CETV-3"],
    "中国教育4台": ["CETV4", "中国教育四台", "中国教育4", "CETV-4 职业教育", "CETV-4"],
    "早期教育": ["中国教育5台", "中国教育五台", "CETV早期教育", "华电早期教育", "CETV 早期教育"],
    "湖南卫视": ["湖南卫视4K"],
    "北京卫视": ["北京卫视4K"],
    "东方卫视": ["东方卫视4K"],
    "广东卫视": ["广东卫视4K"],
    "深圳卫视": ["深圳卫视4K"],
    "山东卫视": ["山东卫视4K"],
    "四川卫视": ["四川卫视4K"],
    "浙江卫视": ["浙江卫视4K"],
    "CHC影迷电影": ["CHC高清电影", "CHC-影迷电影", "影迷电影", "chc高清电影"],
    "淘电影": ["IPTV淘电影", "北京IPTV淘电影", "北京淘电影"],
    "淘精彩": ["IPTV淘精彩", "北京IPTV淘精彩", "北京淘精彩"],
    "淘剧场": ["IPTV淘剧场", "北京IPTV淘剧场", "北京淘剧场"],
    "淘4K": ["IPTV淘4K", "北京IPTV4K超清", "北京淘4K", "淘4K", "淘 4K"],
    "淘娱乐": ["IPTV淘娱乐", "北京IPTV淘娱乐", "北京淘娱乐"],
    "淘BABY": ["IPTV淘BABY", "北京IPTV淘BABY", "北京淘BABY", "IPTV淘baby", "北京IPTV淘baby", "北京淘baby"],
    "淘萌宠": ["IPTV淘萌宠", "北京IPTV萌宠TV", "北京淘萌宠"],
    "魅力足球": ["上海魅力足球"],
    "睛彩青少": ["睛彩羽毛球"],
    "求索纪录": ["求索记录", "求索纪录4K", "求索记录4K", "求索纪录 4K", "求索记录 4K"],
    "金鹰纪实": ["湖南金鹰纪实", "金鹰记实"],
    "纪实科教": ["北京纪实科教", "BRTV纪实科教", "纪实科教8K"],
    "星空卫视": ["星空衛視", "星空衛视", "星空卫視"],
    "CHANNEL[V]": ["CHANNEL-V", "Channel[V]"],
    "凤凰卫视中文台": ["凤凰中文", "凤凰中文台", "凤凰卫视中文", "凤凰卫视"],
    "凤凰卫视香港台": ["凤凰香港台", "凤凰卫视香港", "凤凰香港"],
    "凤凰卫视资讯台": ["凤凰资讯", "凤凰资讯台", "凤凰咨询", "凤凰咨询台", "凤凰卫视咨询台", "凤凰卫视资讯", "凤凰卫视咨询"],
    "凤凰卫视电影台": ["凤凰电影", "凤凰电影台", "凤凰卫视电影", "鳳凰衛視電影台", " 凤凰电影"],
    "茶频道": ["湖南茶频道"],
    "快乐垂钓": ["湖南快乐垂钓"],
    "先锋乒羽": ["湖南先锋乒羽"],
    "天元围棋": ["天元围棋频道"],
    "汽摩": ["重庆汽摩", "汽摩频道", "重庆汽摩频道"],
    "梨园频道": ["河南梨园频道", "梨园", "河南梨园"],
    "文物宝库": ["河南文物宝库"],
    "武术世界": ["河南武术世界"],
    "乐游": ["乐游频道", "上海乐游频道", "乐游纪实", "SiTV乐游频道", "SiTV 乐游频道"],
    "欢笑剧场": ["上海欢笑剧场4K", "欢笑剧场 4K", "欢笑剧场4K", "上海欢笑剧场"],
    "生活时尚": ["生活时尚4K", "SiTV生活时尚", "上海生活时尚"],
    "都市剧场": ["都市剧场4K", "SiTV都市剧场", "上海都市剧场"],
    "游戏风云": ["游戏风云4K", "SiTV游戏风云", "上海游戏风云"],
    "金色学堂": ["金色学堂4K", "SiTV金色学堂", "上海金色学堂"],
    "动漫秀场": ["动漫秀场4K", "SiTV动漫秀场", "上海动漫秀场"],
    "卡酷少儿": ["北京KAKU少儿", "BRTV卡酷少儿", "北京卡酷少儿", "卡酷动画"],
    "哈哈炫动": ["炫动卡通", "上海哈哈炫动"],
    "优漫卡通": ["江苏优漫卡通", "优漫漫画"],
    "金鹰卡通": ["湖南金鹰卡通"],
    "中国交通": ["中国交通频道"],
    "中国天气": ["中国天气频道"],
    # 其他可按需添加
}

RESULTS_PER_CHANNEL = 5  # 每个频道保留源数
# ==============================================

# 修改 URL，循环 C 段 1-255
async def generate_urls(url):
    modified_urls = []
    ip_start = url.find("//")+2
    ip_end = url.find(":", ip_start)
    base = url[:ip_start]
    ip_prefix = url[ip_start:ip_end].rsplit('.',1)[0]
    port = url[ip_end:]
    for i in range(1,256):
        modified_urls.append(f"{base}{ip_prefix}.{i}{port}/iptv/live/1000.json?key=txiptv")
    return modified_urls

async def fetch_json(session, url, semaphore):
    async with semaphore:
        try:
            async with session.get(url, timeout=0.5) as resp:
                data = await resp.json()
                results = []
                for item in data.get('data', []):
                    name = item.get('name')
                    urlx = item.get('url')
                    if not name or not urlx or ',' in urlx:
                        continue
                    if not urlx.startswith("http"):
                        base = url.split("/iptv")[0]
                        urlx = base + urlx
                    # 映射标准名
                    for std_name, aliases in CHANNEL_MAPPING.items():
                        if name in aliases:
                            name = std_name
                            break
                    results.append((name,urlx))
                return results
        except:
            return []

async def check_url(session, url, semaphore):
    async with semaphore:
        try:
            async with session.get(url, timeout=0.5) as resp:
                if resp.status == 200:
                    return url
        except:
            return None

async def main():
    semaphore = asyncio.Semaphore(100)
    async with aiohttp.ClientSession() as session:
        all_urls = []
        for url in urls:
            modified_urls = await generate_urls(url)
            all_urls.extend(modified_urls)

        tasks = [check_url(session, u, semaphore) for u in all_urls]
        valid_urls = [r for r in await asyncio.gather(*tasks) if r]

        tasks = [fetch_json(session, u, semaphore) for u in valid_urls]
        results = []
        for sublist in await asyncio.gather(*tasks):
            results.extend(sublist)

    final_results = [(name, url, 0) for name, url in results]

    itv_dict = {cat: [] for cat in CHANNEL_CATEGORIES}

    for name, url, speed in final_results:
        for cat, channels in CHANNEL_CATEGORIES.items():
            if name in channels:
                itv_dict[cat].append((name, url, speed))
                break

    beijing_now = datetime.datetime.now(
        datetime.timezone(datetime.timedelta(hours=8))
    ).strftime("%Y-%m-%d %H:%M:%S")

    disclaimer_url = "https://kakaxi-1.asia/LOGO/Disclaimer.mp4"

    with open("itvlist.txt", 'w', encoding='utf-8') as f:
        f.write(f"更新时间: {beijing_now}（北京时间）\n\n")

        f.write("更新时间,#genre#\n")
        f.write(f"{beijing_now},{disclaimer_url}\n\n")

        for cat in CHANNEL_CATEGORIES:
            f.write(f"{cat},#genre#\n")

            for ch in CHANNEL_CATEGORIES[cat]:
                ch_items = [x for x in itv_dict[cat] if x[0] == ch]
                ch_items = ch_items[:RESULTS_PER_CHANNEL]

                for item in ch_items:
                    f.write(f"{item[0]},{item[1]}\n")

if __name__ == "__main__":
    asyncio.run(main())
